//2.1
#include <stdio.h>

//точка входа
int main()
{   
    //объявление переменных
    int m, n, f;
    
    //ввод значений
    printf("введите m: ");
    scanf("%d", &m);

    printf("введите n: ");
    scanf("%d", &n);
    
    
    //обработка условия через тернарный оператор
    //функция= условие1? значение1 : условие2? значение2: дефолт значение;
    //: это типо дальше
    f= n<0 && m>0 ? m+n*n : m<=0 && n<0 ? m+2*n : m+1;
    
    //m+n*n можно записать еще как m+pow(n, 2), но тогда нужно будет подключить библиотеку math (#include <math.h>)
    //вывод значения функции
    printf("значение функции f=%d", f);

    //точка выхода
    return 0;
}