//2.2
#include <stdio.h>
//для того чтобы работали функции log(), sin(), cos(), tg(), pow(), нужна библиотека math
#include <math.h>

//точка входа
int main()
{   
    //объявление переменных
    int r;
    float S;
    
    //ввод значений
    printf("введите r: ");
    scanf("%d", &r);
    //Перед написанием программы требуется вычислить область определения функции и учесть её в условии с помощью оператора if else
    if((pow(sin(r), 2)+tan(3*r))!=0 &&  cos(3*r)!=0 && r>0)
    {
    //сама функции S и её вывод
    S=exp( (log(r)-cos(pow(r, 2)))/(pow(sin(r), 2) +tan(3*r)) );
    //ln это log(), если бы было log2(), то так бы и писалось 
    //exp() это e, в скобочках пишется степень в которую она возводится(можно не возводить)
    printf("S=%f", S);
    }
    else
    {
    //если введённое значение попадает в область недопустимых, то выводится это сообщение (конструкция if else (если одно не выполняется по условию, то выполняется другое)) 
    printf("введённое значение не пренадлежит ООФ");    
    }
    
   //точка выхода
    return 0;
}