//2.3
#include <stdio.h>

//точка входа
int main()
{   
    //объявление переменных
    int a, b;
    
    //ввод значений
    printf("введите a: ");
    scanf("%d", &a);

    printf("введите b: ");
    scanf("%d", &b);
    
    // % операция остаток от деления 21%10=1
    //выполнение условий и присваивание значений по заданию
    if(a%2==0 && b%2==0)
    {
        if (a>b)
        {
        a=a/2;
        }
        
        else 
        {
        b=b/2;    
        }
    }
    else if(a%2!=0 && b%2!=0)
    {   
        a=a*2;
        b=b*2;
    }
    else 
    {
        if(a%2!=0)
        {
            a=a+1;
            
        }
        else 
        {
            b=b+1;
        }
    }
    
    printf("a=%d; b=%d", a, b);    
    
   //точка выхода
    return 0;
}