//2.4
#include <stdio.h>

//точка входа
int main()
{    
    //объявление переменных

    
    printf("Двузначные числа, удовлетворяющие заданному условию:\n");
    // \n нужен для переноса строчки на следующую
    
    //цикл в котором мы ищем числа по заданному условию( берем 2-значное число )
    for (int num=10, sum, square; num<100; num++)
    
    //num++ - постфиксный инкремент, увеличение на 1
    {
        // Вычисляем сумму цифр числа
        sum=(num%10)+(num/10);
        
        // Вычисляем квадрат суммы
        square=sum*sum;
        
        // Проверяем, равно ли число сумме и квадрату суммы
        if (num==sum+square)
        {
            printf("%d\n", num);
        }
    }

   //точка выхода
    return 0;
}