//2.5
#include <stdio.h>
#include <math.h>

//точка входа
int main()
{
    float A, B;
    int m = 1;
    
    printf("Введите числа A и B (A > B): ");
    scanf("%f%f", &A, &B);
    
    //проверка условия по заданию (чтобы красиво было и никто не доебался)
    if (A>B && A>1 && B>1)
    {   
        //цикл while идёт до тех пор пока не выполнится условие в скобках
        // powf() то же самое возведение в степень, только для вещественных чисел
        while (powf(B, m)<=m*A)
        {
        m++;
        }
        printf("Наименьшее значение m: %d\n", m);
    }
    else
    {
        printf(" (A меньше B) или (A или B меньше 1)");
    }
    
    
   //точка выхода
    return 0;
}
