//2.8
#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int n = 1;
    //эти переменные объявляем double т.к они взаимодействуют с вещественными числами, и если мы объявим их int то значения поменяются т.к условвно когда int/int то дробная часть отбрсывается
    double x, sum, r = 1;
    printf("введите x: ");
    scanf("%lf", &x);
    
    //проверка условия по заданию
    if (abs(x)<=1)
    {
        printf("введённое значение не пренадлежит ООФ");
    }
    else
    {   
        //цикл для рассчёта бесконечного ряда (идёт до тех пор пока точность между значениями рядов >10^-4)
        while (r > 1e-5)
        {   
            //рассмотрение функции в n-ном виде
            r=1/(n*(pow(x, n)));
            //каждое следующее значение передаётся в переменную sum
            sum+=r;
            n+=2;
        }
    
        //вывод функций
        printf("%.5lf \n", 2*sum);
        printf("%.5lf \n", log( (x+1)/(x-1) ));
        //почему %.5lf а не просто %lf ? в задании указано, чтобы точность была до 10^-4, именно это мы и указываем тут, чтобы значение выводилось до 4 знака после запятой включительно
        //так как после этого знака точность значения упадёт и числа которые мы выводим будут различаться
    }
    
    return 0;
}