//2.9
#include <stdio.h>
int main()
{
    double b, x, P;
    
    printf("Введите значение b: ");
    scanf("%lf", &b);
    
    //для каждого из 10 значений переменной х, изменяющейся от –b до b делаем цикл который будет делать это
    for (int i=(-1)*b; i<=b; i++)
    {
        x=i;
        //P объявляем 1, чтобы можно было умножить на само себя и в дальнейшем передать след. значение 
        P=1;
        //в этом цикле мы считаем для каждого x свой определённый P
        //конструкция цикл в цикле
        for (int j=0; j<=9; j++)
        {
            P*=(x+j*0.2);
        }
        //выводим P в цикле т.к для каждого x он разный
        printf("x = %.1f, P = %.4f\n", x, P);
    }
    
    return 0;
}